zhd-info-app/app/Models/Admin.php

    public function getOrganization1()
    {
        $admin_id = $this->attributes['id'];
        return Organization1::query()
            ->join('admin_organization1', function ($join) use ($admin_id){
                $join->on('admin_organization1.organization1_id', '=', 'organization1.id');
                $join->where('admin_organization1.admin_id', '=', $admin_id);
            })
            ->orderBy('name', 'asc')
            ->get();
---
select * from `organization1` inner join `admin_organization1` on `admin_organization1`.`organization1_id` = `organization1`.`id` and `admin_organization1`.`admin_id` = 82 order by `name` asc