zhd-info-app/app/Models/Message.php

select * from `message_contents` where `message_contents`.`message_id` = 4379 and `message_contents`.`message_id` is not null
---
    public function getContentFileSizeAttribute()
    {
        // 関連する全ての MessageContent インスタンスを取得
        $message_contents = $this->hasMany(MessageContent::class, 'message_id', 'id')->get();