zhd-info-app/app/Models/Organization1.php

select distinct `organization5`.`id`, `organization5`.`name`, `organization5`.`order_no` from `shops` left join `organization5` on `organization5_id` = `organization5`.`id` where `organization1_id` = 2 and `organization5_id` is not null order by `organization5`.`order_no` asc
---
    public function getOrganization5()
    {
        $organization5 = Shop::query()
            ->select(['organization5.id', 'organization5.name', 'organization5.order_no'])
            ->distinct('organization5.name')
            ->where('shops.organization1_id', '=', $this->id)
            ->whereNotNull('shops.organization5_id')
            ->leftjoin('organization5', 'shops.organization5_id', '=', 'organization5.id')
            ->orderby('organization5.order_no')
            ->get();

select distinct `organization4`.`id`, `organization4`.`name`, `organization4`.`order_no` from `shops` left join `organization4` on `organization4_id` = `organization4`.`id` where `organization1_id` = 4 and `organization4_id` is not null order by `organization4`.`order_no` asc
---
    public function getOrganization4()
    {
        $organization4 = Shop::query()
            ->select(['organization4.id', 'organization4.name', 'organization4.order_no'])
            ->distinct('organization4.name')
            ->where('shops.organization1_id', '=', $this->id)
            ->whereNotNull('shops.organization4_id')
            ->leftjoin('organization4', 'shops.organization4_id', '=', 'organization4.id')
            ->orderby('organization4.order_no')
            ->get();

select distinct `organization3`.`id`, `organization3`.`name`, `organization3`.`order_no` from `shops` left join `organization3` on `organization3_id` = `organization3`.`id` where `organization1_id` = 2 and `organization3_id` is not null order by `organization3`.`order_no` asc
---
    public function getOrganization3()
    {
        $organization3 = Shop::query()
            ->select(['organization3.id', 'organization3.name', 'organization3.order_no'])
            ->distinct('organization3.name')
            ->where('shops.organization1_id', '=', $this->id)
            ->whereNotNull('shops.organization3_id')
            ->leftjoin('organization3', 'shops.organization3_id', '=', 'organization3.id')
            ->orderby('organization3.order_no')
            ->get();

select exists(select * from `shops` where `organization1_id` = 2 and `organization5_id` is not null) as `exists`
---
    public function isExistOrg5()
    {
        return Shop::query()
            ->where('organization1_id', $this->id)
            ->whereNotNull('organization5_id')
            ->exists();

select exists(select * from `shops` where `organization1_id` = 2 and `organization4_id` is not null) as `exists`
---
    public function isExistOrg4()
    {
        return Shop::query()
            ->where('organization1_id', $this->id)
            ->whereNotNull('organization4_id')
            ->exists();

select exists(select * from `shops` where `organization1_id` = 2 and `organization3_id` is not null) as `exists`
---
    public function isExistOrg3()
    {
        return Shop::query()
            ->where('organization1_id', $this->id)
            ->whereNotNull('organization3_id')
            ->exists();