zhd-info-app/app/Http/Controllers/Admin/AuthController.php

select * from `admin` where `employee_code` = 'admin' and `admin`.`deleted_at` is null limit 1
---
    public function login (AuthLoginRequest $request)
    {
        $validated = $request->validated();

        $admin = Admin::where('employee_code', $request->employee_code)->first();

select `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'message-publish' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
---
    public function getMessageSavedUrl(Admin $admin)
    {
        $message_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'message-publish')
            ->where('deleted_at', null)
            ->select('url')
            ->first();