zhd-info-app/app/Http/Controllers/Admin/Account/AccountController.php

    public function index(Request $request)
    {
        $admin = session('admin');
        $organization1_list = $admin->organization1()->orderby('name')->get();
        $roll_list = Roll::all();

        // request
        $orgs = $request->input('org');
        $shop_freeword = $request->input('shop_freeword');

        $organization1_id = $request->input('organization1') ? base64_decode($request->input('organization1')) : $organization1_list[0]->id;
        $organization1 = Organization1::find($organization1_id);
---
select `organization1`.*, `admin_organization1`.`admin_id` as `pivot_admin_id`, `admin_organization1`.`organization1_id` as `pivot_organization1_id` from `organization1` inner join `admin_organization1` on `organization1`.`id` = `admin_organization1`.`organization1_id` where `admin_organization1`.`admin_id` = 82 order by `name` asc
select * from `rolls`
select * from `organization1` where `organization1`.`id` = 2 limit 1

            ->leftJoin('organization4', 'shops.organization4_id', '=', 'organization4.id')
            ->leftJoin('organization5', 'shops.organization5_id', '=', 'organization5.id')
            ->when(isset($q), function ($query) use ($q) {
                $query->whereLike('shops.name', $q);
            })
            ->when(!empty($shops), function ($query) use ($shops) {
                $query->whereIn('users.shop_id', $shops);
            })
            ->when(isset($roll), function ($query) use ($roll) {
                $query->where('roll_id', '=', $roll);
            })
            ->when(isset($organization1_id), function ($query) use ($organization1_id) {
                $query->where('shops.organization1_id', '=', $organization1_id);
            })
            ->where('shops.organization1_id', '=', $organization1->id)
            ->when(isset($orgs['DS']), function ($query) use ($orgs) {
                $query->whereIn('shops.organization3_id', $orgs['DS']);
            })
            ->when(isset($orgs['AR']), function ($query) use ($orgs) {
                $query->whereIn('shops.organization4_id', $orgs['AR']);
            })
            ->when(isset($orgs['BL']), function ($query) use ($orgs) {
                $query->whereIn('shops.organization5_id', $orgs['BL']);
            })
            ->when(isset($shop_freeword), function ($query) use ($shop_freeword) {
---
select count(*) as aggregate from `users` left join `shops` on `users`.`shop_id` = `shops`.`id` left join `wowtalk_shops` on `users`.`shop_id` = `wowtalk_shops`.`shop_id` left join `organization3` on `shops`.`organization3_id` = `organization3`.`id` left join `organization4` on `shops`.`organization4_id` = `organization4`.`id` left join `organization5` on `shops`.`organization5_id` = `organization5`.`id` where `shops`.`organization1_id` = 2 and `shops`.`organization1_id` = 2 and `users`.`deleted_at` is null

        });

        // 検索条件を取得
        $message_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'message-publish')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();
        $manual_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'manual-publish')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();
        $analyse_personal_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'analyse-personal')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();
---
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'message-publish' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'manual-publish' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'analyse-personal' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1

    public function getOrganization(Request $request)
    {
        $organization1_id = $request->input("organization1");
        $organization1 = Organization1::findOrFail($organization1_id);
---
select * from `organization1` where `organization1`.`id` = '4' limit 1