zhd-info-app/app/Http/Controllers/Admin/Account/AdminAccountController.php

select * from `admin` limit 50 offset 0
select count(*) as aggregate from `admin`
select * from `organization1` order by `name` asc
select * from `adminpages` order by `name` asc
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'message-publish' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'manual-publish' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'analyse-personal' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
---
    public function index()
    {
        $admin = session('admin');
        $admin_list = Admin::withTrashed()->paginate(50);
        $organization1_list = Organization1::orderby('name')->get();
        $page_list = Adminpage::orderby('name')->get();

        // 検索条件を取得
        $message_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'message-publish')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();
        $manual_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'manual-publish')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();
        $analyse_personal_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'analyse-personal')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();