zhd-info-app/app/Http/ViewComposers/ImsStatusComposer.php

    public function compose(View $view)
    {
        $log = ImsSyncLog::orderBy('created_at', 'DESC')->orderBy('id', 'DESC')->first();
---
select * from `ims_sync_logs` order by `created_at` desc, `id` desc limit 1