zhd-info-app/app/Http/Controllers/Admin/Message/MessagePublishController.php

    public function show(Request $request, $message_id)
    {
        $admin = session('admin');
        $message = Message::where('id', $message_id)
            ->withCount(['user as total_users'])
            ->withCount(['readed_user as read_users'])
            ->first();

        $_brand = $admin->organization1->brand()->orderBy('id', 'asc');
        $brands = $_brand->pluck('name')->toArray();
        $brand_list = $_brand->get();
        $org3_list = Organization1Repository::getOrg3($admin->organization1_id);
        $org4_list = Organization1Repository::getOrg4($admin->organization1_id);
        $org5_list = Organization1Repository::getOrg5($admin->organization1_id);

        // request
        $brand_id = $request->input('brand');
        $shop_code = $request->input('shop_code');
        $shop_name = $request->input('shop_name');
        $org3 = $request->input('org3');
        $org4 = $request->input('org4');
        $org5 = $request->input('org5');
        $read_flg = $request->input('read_flg');
        $readed_date = $request->input('readed_date');

        $shop_list = $message
                        ->shop()
                        ->when(isset($brand_id), function ($query) use ($brand_id) {
                            $query->where('brand_id', $brand_id);
                        })
                        ->when(isset($shop_code), function ($query) use ($shop_code) {
                            $query->where('shop_code', $shop_code);
                        })
                        ->when(isset($shop_name), function ($query) use ($shop_name) {
                            $query->whereLike('name', $shop_name);
                        })
                        ->when(isset($org3), function ($query) use ($org3) {
                            $query->where('organization3_id', $org3);
                        })
                        ->when(isset($org4), function ($query) use ($org4) {
                            $query->where('organization4_id', $org4);
                        })
                        ->when(isset($org5), function ($query) use ($org5) {
                            $query->where('organization5_id', $org5);
                        })
                        ->pluck('id')
                        ->unique()
                        ->toArray();
---
select `brands`.*, `message_brand`.`message_id` as `pivot_message_id`, `message_brand`.`brand_id` as `pivot_brand_id` from `brands` inner join `message_brand` on `brands`.`id` = `message_brand`.`brand_id` where `message_brand`.`message_id` in (4284, 4287, 4290, 4291, 4292, 4297, 4298, 4299, 4300, 4301, 4302, 4303, 4306, 4311, 4317, 4318, 4319, 4320, 4324, 4325, 4326, 4327, 4328, 4329, 4330, 4331, 4332, 4339, 4340, 4341, 4346, 4348, 4349, 4350, 4351, 4352, 4353, 4354, 4355, 4356, 4358, 4359, 4360, 4366, 4367, 4372, 4373, 4374, 4375, 4379)