zhd-info-app/app/Http/Controllers/Admin/Message/MessagePublishController.php

select * from `message_categories`
select * from `organization1` where `organization1`.`id` = '8' limit 1
---
    public function index(Request $request)
    {
        $admin = session('admin');
        $category_list = MessageCategory::all();
        $organization1_list = $admin->getOrganization1();

        // request
        $category_ids = $request->input('category');
        $statusArray = $request->input('status') ?? [];
        $statuses = array_map(function($status) {
            return PublishStatus::tryFrom((int)$status);
        }, $statusArray);
        $q = $request->input('q');
        $organization1_id = $request->input('brand') ? base64_decode($request->input('brand')) : $organization1_list[0]->id;
        $label = $request->input('label');
        $publish_date = $request->input('publish-date');

        $organization1 = Organization1::find($organization1_id);

select * from `messages` where `id` = 4379
select * from `message_contents` where `message_id` = 4379
---
            $file_list = [];
            $is_first_join = false;

            $all_message_join_file = Message::where('id', $message->id)->get()->toArray();
            $all_message_content_single_files = MessageContent::where('message_id', $message->id)->get()->toArray();

select count(*) as aggregate from `shops` where `organization1_id` = '8'
select `message_id`, COUNT(*) as shop_count from `message_shop` where `message_id` in (4379, 4375, 4374, 4373, 4372, 4367, 4366, 4360, 4359, 4358, 4356, 4355, 4354, 4353, 4352, 4351, 4350, 4349, 4348, 4346, 4341, 4340, 4339, 4332, 4331, 4330, 4329, 4328, 4327, 4326, 4325, 4324, 4320, 4319, 4318, 4317, 4311, 4306, 4303, 4302, 4301, 4300, 4299, 4298, 4297, 4292, 4291, 4290, 4287, 4284) group by `message_id`
---
            // すべてのメッセージIDを取得
            $message_ids = $message_list->pluck('id')->toArray();
            // すべての店舗数を取得
            $all_shop_count = Shop::where('organization1_id', $organization1_id)->count();
            // 各メッセージに関連する店舗数を取得
            $message_shop_counts = MessageShop::select('message_id', DB::raw('COUNT(*) as shop_count'))
                ->whereIn('message_id', $message_ids)
                ->groupBy('message_id')
                ->pluck('shop_count', 'message_id');

select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'message-publish' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'manual-publish' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'analyse-personal' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
select `contents` from `environments` where `command_name` = 'message-publish' and `type` = 'message' limit 1
---
        }

        // 検索条件を取得
        $message_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'message-publish')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();
        $manual_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'manual-publish')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();
        $analyse_personal_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'analyse-personal')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();

        // 特定のURLにアクセスされた場合
        $specificUrl = Environment::where('command_name', 'message-publish')->where('type', 'message')->select('contents')->first();