zhd-info-app/app/Http/Controllers/MessageController.php


        $categories = MessageCategory::get();
        $organization1_id =  $user->shop->organization1->id;
        $keywords = DB::table("message_search_logs as m_s_l")
            ->select([
                'keyword',
                DB::raw('COUNT(*) as count'),
            ])
            ->leftJoin('shops as s', 's.id', 'm_s_l.shop_id')
            ->Join('organization1 as o1', function ($join) use ($organization1_id) {
                $join->on('o1.id', '=', 's.organization1_id')
                    ->where('o1.id', '=', $organization1_id);
            })
            ->groupBy('keyword', 'o1.id')
            ->orderBy('count', 'desc')
            ->limit(3)
            ->get();
---
select `keyword`, COUNT(*) as count from `message_search_logs` as `m_s_l` left join `shops` as `s` on `s`.`id` = `m_s_l`.`shop_id` inner join `organization1` as `o1` on `o1`.`id` = `s`.`organization1_id` and `o1`.`id` = 2 group by `keyword`, `o1`.`id` order by `count` desc limit 3