zhd-info-app/app/Http/Controllers/TopController.php

select `messages`.*, `message_user`.`user_id` as `pivot_user_id`, `message_user`.`message_id` as `pivot_message_id`, `message_user`.`read_flg` as `pivot_read_flg`, `message_user`.`shop_id` as `pivot_shop_id` from `messages` inner join `message_user` on `messages`.`id` = `message_user`.`message_id` where `message_user`.`user_id` = 392 and `start_datetime` between '2025-02-20 00:00:00' and '2025-02-27 15:29:28' and (`end_datetime` > '2025-02-27 15:29:28' or `end_datetime` is null) and `editing_flg` = 0 order by `start_datetime` desc
select `messages`.*, `message_user`.`user_id` as `pivot_user_id`, `message_user`.`message_id` as `pivot_message_id`, `message_user`.`read_flg` as `pivot_read_flg`, `message_user`.`shop_id` as `pivot_shop_id` from `messages` inner join `message_user` on `messages`.`id` = `message_user`.`message_id` where `message_user`.`user_id` = 392 and `start_datetime` <= '2025-02-27 15:29:28' and (`end_datetime` > '2025-02-27 15:29:28' or `end_datetime` is null) and `editing_flg` = 0 order by `start_datetime` desc limit 1
select `manuals`.*, `manual_user`.`user_id` as `pivot_user_id`, `manual_user`.`manual_id` as `pivot_manual_id`, `manual_user`.`read_flg` as `pivot_read_flg`, `manual_user`.`shop_id` as `pivot_shop_id` from `manuals` inner join `manual_user` on `manuals`.`id` = `manual_user`.`manual_id` where `manual_user`.`user_id` = 392 and `start_datetime` between '2025-02-20 00:00:00' and '2025-02-27 15:29:28' and (`end_datetime` > '2025-02-27 15:29:28' or `end_datetime` is null) and `editing_flg` = 0 order by `start_datetime` desc
select `manuals`.*, `manual_user`.`user_id` as `pivot_user_id`, `manual_user`.`manual_id` as `pivot_manual_id`, `manual_user`.`read_flg` as `pivot_read_flg`, `manual_user`.`shop_id` as `pivot_shop_id` from `manuals` inner join `manual_user` on `manuals`.`id` = `manual_user`.`manual_id` where `manual_user`.`user_id` = 392 and `start_datetime` <= '2025-02-27 15:29:28' and (`end_datetime` > '2025-02-27 15:29:28' or `end_datetime` is null) and `editing_flg` = 0 order by `start_datetime` desc limit 1
---
    public function index(Request $request)
    {
        $user = session('member');

        $request->session()->forget('check_crew');
        $request->session()->forget('reading_crews');

        $start_date_time = Carbon::now()->subDays(7)->startOfDay();
        // 新着件数
        // 過去1週間にの件数
        $recent_messages = $user->message()
                                ->whereBetween('start_datetime', [$start_date_time, now('Asia/Tokyo')])
                                ->where(function ($query) {
                                    $query->where('end_datetime', '>', now('Asia/Tokyo'))
                                    ->orWhereNull('end_datetime');
                                })
                                ->where('editing_flg', false)
                                ->orderBy('start_datetime', 'desc')
                                ->get();

        $recent_message_start_datetime = $user->message()
                                ->where('start_datetime', '<=', now('Asia/Tokyo'))
                                ->where(function ($query) {
                                    $query->where('end_datetime', '>', now('Asia/Tokyo'))
                                    ->orWhereNull('end_datetime');
                                })
                                ->where('editing_flg', false)
                                ->orderBy('start_datetime', 'desc')
                                ->limit(1)
                                ->get();

        $recent_manuals = $user->manual()
                                ->whereBetween('start_datetime', [$start_date_time, now('Asia/Tokyo')])
                                ->where(function ($query) {
                                    $query->where('end_datetime', '>', now('Asia/Tokyo'))
                                    ->orWhereNull('end_datetime');
                                })
                                ->where('editing_flg', false)
                                ->orderBy('start_datetime', 'desc')
                                ->get();

        $recent_manual_start_datetime = $user->manual()
                                ->where('start_datetime', '<=', now('Asia/Tokyo'))
                                ->where(function ($query) {
                                    $query->where('end_datetime', '>', now('Asia/Tokyo'))
                                    ->orWhereNull('end_datetime');
                                })
                                ->where('editing_flg', false)
                                ->orderBy('start_datetime', 'desc')
                                ->limit(1)
                                ->get();