zhd-info-app/app/Http/Controllers/Admin/Manual/ManualPublishController.php

    public function index(Request $request)
    {
        $admin = session('admin');
        $new_category_list = ManualCategoryLevel2::query()
            ->select([
                'manual_category_level2s.id as id',
                DB::raw('concat(manual_category_level1s.name, "|", manual_category_level2s.name) as name')
            ])
            ->leftjoin('manual_category_level1s', 'manual_category_level1s.id', '=', 'manual_category_level2s.level1')
            ->get();

        $organization1_list = $admin->getOrganization1();

        // request
        $new_category_ids = $request->input('new_category');
        $statusArray = $request->input('status') ?? [];
        $statuses = array_map(function ($status) {
            return PublishStatus::tryFrom((int)$status);
        }, $statusArray);
        $q = $request->input('q');
        $organization1_id = $request->input('brand') ? base64_decode($request->input('brand')) : $organization1_list[0]->id;
        $publish_date = $request->input('publish-date');

        $organization1 = Organization1::find($organization1_id);
---
select `manual_category_level2s`.`id` as `id`, concat(manual_category_level1s.name, "|", manual_category_level2s.name) as name from `manual_category_level2s` left join `manual_category_level1s` on `manual_category_level1s`.`id` = `manual_category_level2s`.`level1`
select * from `organization1` where `organization1`.`id` = '2' limit 1

            // すべてのマニュアルIDを取得
            $manual_ids = $manual_list->pluck('id')->toArray();
            // すべての店舗数を取得
            $all_shop_count = Shop::where('organization1_id', $organization1_id)->count();
            // 各マニュアルに関連する店舗数を取得
            $manual_shop_counts = ManualShop::select('manual_id', DB::raw('COUNT(*) as shop_count'))
                ->whereIn('manual_id', $manual_ids)
                ->groupBy('manual_id')
                ->pluck('shop_count', 'manual_id');
---
select count(*) as aggregate from `shops` where `organization1_id` = '2'
select `manual_id`, COUNT(*) as shop_count from `manual_shop` where `manual_id` in (900, 899, 898, 897, 896, 895, 893, 892, 891, 890, 889, 888, 882, 881, 880, 877, 876, 875, 872, 871, 866, 865, 864, 863, 862, 861, 859, 858, 857, 856, 853, 846, 845, 844, 843, 842, 838, 837, 836, 831, 826, 825, 824, 819, 818, 817, 816, 815, 814, 809) group by `manual_id`

        }

        // 検索条件を取得
        $message_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'message-publish')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();
        $manual_saved_url = SearchCondition::where('admin_id', $admin->id)
            ->where('page_name', 'manual-publish')
            ->where('deleted_at', null)
            ->select('page_name', 'url')
            ->first();
---
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'manual-publish' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1
select `page_name`, `url` from `search_conditions` where `admin_id` = 82 and `page_name` = 'analyse-personal' and `deleted_at` is null and `search_conditions`.`deleted_at` is null limit 1

            ->first();

        // 特定のURLにアクセスされた場合
        $specificUrl = Environment::where('command_name', 'manual-publish')->where('type', 'manual')->select('contents')->first();
---
select `contents` from `environments` where `command_name` = 'manual-publish' and `type` = 'manual' limit 1