zhd-info-app/app/Http/Controllers/Admin/Manual/ManualPublishController.php

select `brands`.*, `manual_brand`.`manual_id` as `pivot_manual_id`, `manual_brand`.`brand_id` as `pivot_brand_id` from `brands` inner join `manual_brand` on `brands`.`id` = `manual_brand`.`brand_id` where `manual_brand`.`manual_id` in (809, 814, 815, 816, 817, 818, 819, 824, 825, 826, 831, 836, 837, 838, 842, 843, 844, 845, 846, 853, 856, 857, 858, 859, 861, 862, 863, 864, 865, 866, 871, 872, 875, 876, 877, 880, 881, 882, 888, 889, 890, 891, 892, 893, 895, 896, 897, 898, 899, 900)
---
    public function show(Request $request, $manual_id)
    {
        $manual = Manual::where('id', $manual_id)
            ->withCount(['user as total_users'])
            ->withCount(['readed_user as read_users'])
            ->first();

        $organization1 = $manual->organization1;
        $_brand = $organization1->brand()->orderBy('id', 'asc');
        $brands = $_brand->pluck('name')->toArray();
        $brand_list = $_brand->get();
        $org3_list = Organization1Repository::getOrg3($organization1);
        $org4_list = Organization1Repository::getOrg4($organization1);
        $org5_list = Organization1Repository::getOrg5($organization1);

        // request
        $brand_id = $request->input('brand');
        $shop_freeword = $request->input('shop_freeword');
        $org3 = $request->input('org3');
        $org4 = $request->input('org4');
        $org5 = $request->input('org5');
        $read_flg = $request->input('read_flg');
        $readed_date = $request->input('readed_date');

        $shop_list = $manual
            ->shop()
            ->when(isset($brand_id), function ($query) use ($brand_id) {
                $query->where('brand_id', $brand_id);
            })
            ->when(isset($shop_freeword), function ($query) use ($shop_freeword) {
                $query->whereLike('name', $shop_freeword)
                    ->orwhere(DB::raw('SUBSTRING(shop_code, -4)'), 'LIKE', '%' . $shop_freeword . '%');
            })
            ->when(isset($org3), function ($query) use ($org3) {
                $query->where('organization3_id', $org3);
            })
            ->when(isset($org4), function ($query) use ($org4) {
                $query->where('organization4_id', $org4);
            })
            ->when(isset($org5), function ($query) use ($org5) {
                $query->where('organization5_id', $org5);
            })
            ->pluck('id')
            ->unique()
            ->toArray();